cases/heated_obstacle_channel/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    topWall
    {
        type           fixedValue;
        value uniform 300;
    }

    inlet
    {
        type           fixedValue;
        value uniform 300;
    }
    outlet
    {
        type           zeroGradient;
    }
    lowerWall
    {
        type           fixedValue;
        value uniform 400;
    }
    Obstacle
    {
        type           fixedValue;
        value uniform 450;
    }
    ObstacleLeft
    {
        type           fixedValue;
        value uniform 450;
    }
    ObstacleRight
    {
        type           fixedValue;
        value uniform 450;
    }
}


// ************************************************************************* //
