cases/heated_obstacle_channel/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField

{
    topWall
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    Obstacle
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    ObstacleLeft
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    ObstacleRight
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
}

// ************************************************************************* //
