cases/heated_obstacle_channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (4.5 0 0)
    (5.5 0 0)
    (10 0 0)
    (0 4 0)
    (4.5 4 0)
    (5.5 4 0)
    (10 4 0)
    (0 10 0)
    (4.5 10 0)
    (5.5 10 0)
    (10 10 0)
    (0 0 1)
    (4.5 0 1)
    (5.5 0 1)
    (10 0 1)
    (0 4 1)
    (4.5 4 1)
    (5.5 4 1)
    (10 4 1)
    (0 10 1)
    (4.5 10 1)
    (5.5 10 1)
    (10 10 1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (18 16 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (18 16 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (18 24 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (4 24 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (18 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
            
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
        );
    }
    Obstacle
    {
        type wall;
        faces
        (
            (5 6 18 17) 
        );
    }
    ObstacleLeft
    {
        type wall;
        faces
        (
            (1 5 17 13) 
        );
    }
    ObstacleRight
    {
        type wall;
        faces
        (
            (2 14 18 6) 
        );
    }
);


// ************************************************************************* //
